Documents/СписаниеТовараСЗоныОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>СписаниеТовараСЗоныОтгрузки</Name>
			<BasedOn>
				<xr:Item>Document.БольшаяЯчеистаяСборка</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗонаОтгрузки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументБЯС</Name>
					<Comment>Списанный документ</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолКоробок</Name>
					<Comment>Количество Коробок Для Списания</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЗонаОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ЗонаОтгрузки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКоробок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерМестаОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПрихода</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/СписаниеТовараСЗоныОтгрузки/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.БольшаяЯчеистаяСборка") Тогда
		// Заполнение шапки
		ДокументБЯС = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ЗонаОтгрузки Приход
	
	Если ЗначениеЗаполнено(ДокументБЯС) Тогда
		Движения.ЗонаОтгрузки.Записывать = Истина;
		
		
		Если ЗначениеЗаполнено(МестоОтгрузки) И КолКоробок<>0 Тогда
			    Движение = Движения.ЗонаОтгрузки.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.НомерМестаОтгрузки = МестоОтгрузки;
				Движение.ДокументПрихода = ДокументБЯС;
                Движение.КоличествоКоробок = КолКоробок;
				
			
		Иначе // Списываем Всю Сборку	
			
			Для Каждого стр_МестаОтгрузки Из  ДокументБЯС.МестаОтгрузки Цикл
				Движение = Движения.ЗонаОтгрузки.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.НомерМестаОтгрузки = стр_МестаОтгрузки.МестоОтгрузки;
				Движение.ДокументПрихода = ДокументБЯС;
				//Движение.Вес = ДокументБЯС.ОбщийВес;
				Движение.КоличествоКоробок = стр_МестаОтгрузки.КоличествоКоробок;
				//Движение.Объем = ДокументБЯС.ОбщийОбъем;	
				
				
			КонецЦикла;                                                  
		КонецЕсли;
		//Модифицируем ДокБЯС
		ДокБЯС=ДокументБЯС.ПолучитьОбъект();
		ДокБЯС.Списан=Истина;
		ДокБЯС.ДокументСписания=Ссылка;
		ДокБЯС.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	//Модифицируем ДокБЯС
	Попытка
	ДокБЯС=ДокументБЯС.ПолучитьОбъект();
			ДокБЯС.Списан=Ложь;
			ДокБЯС.ДокументСписания="";
			ДокБЯС.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			КонецПопытки;
КонецПроцедуры
